#include <chrono>
#include <iostream>
#include <thread>
using namespace std;

// Mã màu ANSI
#define RESET "\033[0m"
#define RED "\033[31m"
#define GREEN "\033[32m"
#define YELLOW "\033[33m"
#define BLUE "\033[34m"
#define MAGENTA "\033[35m"
#define CYAN "\033[36m"
#define WHITE "\033[37m"
#define BOLD "\033[1m"

void drawTHUVIEN_Banner() {
    cout << GREEN << BOLD << R"(
 ██████╗ ██╗   ██╗ █████╗ ███╗   ██╗     ██╗     ██╗   ██╗   ████████╗██╗  ██╗██╗   ██╗   ██╗     ██╗██╗███████╗██╗███╗   ██╗
██╔═══██╗██║   ██║██╔══██╗████╗  ██║     ██║      ██║ ██║    ╚══██╔══╝██║  ██║██║   ██║   ██║     ██║██║██╔════╝██║████╗  ██║
██║   ██║██║   ██║███████║██╔██╗ ██║     ██║        ██║         ██║   ███████║██║   ██║   ██║     ██║██║█████╗  ██║██╔██╗ ██║
██║▄▄ ██║██║   ██║██╔══██║██║╚██╗██║     ██║        ██║         ██║   ██╔══██║██║   ██║     ██║ ██║  ██║██╔══╝  ██║██║╚██╗██║
╚██████╔╝╚██████╔╝██║  ██║██║ ╚████║     ███████╗   ██║         ██║   ██║  ██║╚██████╔╝      ║██║    ██║███████╗██║██║ ╚████║
 ╚══▀▀═╝  ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═══╝     ╚══════╝   ╚═╝         ╚═╝   ╚═╝  ╚═╝ ╚═════╝       ╚══╝    ╚═╝╚══════╝╚═╝╚═╝  ╚═══╝
    )" << endl;
    cout << YELLOW << BOLD << "║                                                   📚  T H U   V I E N  📚                                                 ║\n";
    cout << RED << BOLD << "║                                                        N H O M   3 6                                                      ║\n";
    // reset lại màu
    cout << "\n";
}
void loadingEffect() {
    cout << MAGENTA << "\nĐang khởi động hệ thống thư viện";
    for (int i = 0; i < 6; ++i) {
        cout << ".";
        cout.flush();
        this_thread::sleep_for(chrono::milliseconds(300));
    }
    cout << "\n\n"
         << RESET;
}
